Ran Plan for 2 projects:

1. dir: `dynamodb/dynamodb-input` workspace: `default`
1. dir: `dynamodb/dynamodb-output` workspace: `default`
---

### 1. dir: `dynamodb/dynamodb-input` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_dynamodb_table.dynamodb_input will be created
+ resource "aws_dynamodb_table" "dynamodb_input" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "dynamodb-input"
      + range_key        = "sort_key_name"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/dynamodb/dynamodb-input"
          + "environment" = "development"
          + "name"        = "dynamodb-input"
        }
      + tags_all         = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/dynamodb/dynamodb-input"
          + "environment" = "development"
          + "name"        = "dynamodb-input"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "created_at"
          + type = "N"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "sort_key_name"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "created_at"
          + name               = "CreatedAtIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ttl_attribute"
          + enabled        = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ dynamodb_table_arn        = (known after apply)
+ dynamodb_table_stream_arn = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d dynamodb/dynamodb-input
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252Fdynamodb%252Fdynamodb-input%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d dynamodb/dynamodb-input
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `dynamodb/dynamodb-output` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_dynamodb_table.dynamodb_output will be created
+ resource "aws_dynamodb_table" "dynamodb_output" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "dynamodb-output"
      + range_key        = "sort_key_name"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/dynamodb/dynamodb-output"
          + "environment" = "development"
          + "name"        = "dynamodb-output"
        }
      + tags_all         = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/dynamodb/dynamodb-output"
          + "environment" = "development"
          + "name"        = "dynamodb-output"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "created_at"
          + type = "N"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "sort_key_name"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "created_at"
          + name               = "CreatedAtIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ttl_attribute"
          + enabled        = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ dynamodb_table_arn        = (known after apply)
+ dynamodb_table_stream_arn = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d dynamodb/dynamodb-output
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252Fdynamodb%252Fdynamodb-output%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d dynamodb/dynamodb-output
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```